MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB288/mcu.h
extern volatile __GLCDCURDATA68bits_t GLCDCURDATA68bits __asm__ ("GLCDCURDATA68") __attribute__((section("sfrs"), address(0xBF8EA910)));
#define GLCDCURDATA69 GLCDCURDATA69
extern volatile uint32_t   GLCDCURDATA69 __attribute__((section("sfrs"), address(0xBF8EA914)));
typedef struct {
  uint32_t PIXEL1715:4;
  uint32_t PIXEL1714:4;
  uint32_t PIXEL1713:4;
  uint32_t PIXEL1712:4;
  uint32_t PIXEL1711:4;
  uint32_t PIXEL1710:4;
  uint32_t PIXEL179:4;
  uint32_t PIXEL178:4;
} __GLCDCURDATA69bits_t;
extern volatile __GLCDCURDATA69bits_t GLCDCURDATA69bits __asm__ ("GLCDCURDATA69") __attribute__((section("sfrs"), address(0xBF8EA914)));
#define GLCDCURDATA70 GLCDCURDATA70
extern volatile uint32_t   GLCDCURDATA70 __attribute__((section("sfrs"), address(0xBF8EA918)));
typedef struct {
  uint32_t PIXEL1723:4;
  uint32_t PIXEL1722:4;
  uint32_t PIXEL1721:4;
  uint32_t PIXEL1720:4;
  uint32_t PIXEL1719:4;
  uint32_t PIXEL1718:4;
  uint32_t PIXEL1717:4;
  uint32_t PIXEL1716:4;
} __GLCDCURDATA70bits_t;
extern volatile __GLCDCURDATA70bits_t GLCDCURDATA70bits __asm__ ("GLCDCURDATA70") __attribute__((section("sfrs"), address(0xBF8EA918)));
#define GLCDCURDATA71 GLCDCURDATA71
extern volatile uint32_t   GLCDCURDATA71 __attribute__((section("sfrs"), address(0xBF8EA91C)));
typedef struct {
  uint32_t PIXEL1731:4;
  uint32_t PIXEL1730:4;
  uint32_t PIXEL1729:4;
  uint32_t PIXEL1728:4;
  uint32_t PIXEL1727:4;
  uint32_t PIXEL1726:4;
  uint32_t PIXEL1725:4;
  uint32_t PIXEL1724:4;
} __GLCDCURDATA71bits_t;
extern volatile __GLCDCURDATA71bits_t GLCDCURDATA71bits __asm__ ("GLCDCURDATA71") __attribute__((section("sfrs"), address(0xBF8EA91C)));
#define GLCDCURDATA72 GLCDCURDATA72
extern volatile uint32_t   GLCDCURDATA72 __attribute__((section("sfrs"), address(0xBF8EA920)));
typedef struct {
  uint32_t PIXEL187:4;
  uint32_t PIXEL186:4;
  uint32_t PIXEL185:4;
  uint32_t PIXEL184:4;
  uint32_t PIXEL183:4;
  uint32_t PIXEL182:4;
  uint32_t PIXEL181:4;
  uint32_t PIXEL180:4;
} __GLCDCURDATA72bits_t;
extern volatile __GLCDCURDATA72bits_t GLCDCURDATA72bits __asm__ ("GLCDCURDATA72") __attribute__((section("sfrs"), address(0xBF8EA920)));
#define GLCDCURDATA73 GLCDCURDATA73
extern volatile uint32_t   GLCDCURDATA73 __attribute__((section("sfrs"), address(0xBF8EA924)));
typedef struct {
  uint32_t PIXEL1815:4;
  uint32_t PIXEL1814:4;
  uint32_t PIXEL1813:4;
  uint32_t PIXEL1812:4;
  uint32_t PIXEL1811:4;
  uint32_t PIXEL1810:4;
  uint32_t PIXEL189:4;
  uint32_t PIXEL188:4;
} __GLCDCURDATA73bits_t;
extern volatile __GLCDCURDATA73bits_t GLCDCURDATA73bits __asm__ ("GLCDCURDATA73") __attribute__((section("sfrs"), address(0xBF8EA924)));
#define GLCDCURDATA74 GLCDCURDATA74
extern volatile uint32_t   GLCDCURDATA74 __attribute__((section("sfrs"), address(0xBF8EA928)));
typedef struct {
  uint32_t PIXEL1823:4;
  uint32_t PIXEL1822:4;
  uint32_t PIXEL1821:4;
  uint32_t PIXEL1820:4;
  uint32_t PIXEL1819:4;
  uint32_t PIXEL1818:4;
  uint32_t PIXEL1817:4;
  uint32_t PIXEL1816:4;
} __GLCDCURDATA74bits_t;
extern volatile __GLCDCURDATA74bits_t GLCDCURDATA74bits __asm__ ("GLCDCURDATA74") __attribute__((section("sfrs"), address(0xBF8EA928)));
#define GLCDCURDATA75 GLCDCURDATA75
extern volatile uint32_t   GLCDCURDATA75 __attribute__((section("sfrs"), address(0xBF8EA92C)));
typedef struct {
  uint32_t PIXEL1831:4;
  uint32_t PIXEL1830:4;
  uint32_t PIXEL1829:4;
  uint32_t PIXEL1828:4;
  uint32_t PIXEL1827:4;
  uint32_t PIXEL1826:4;
  uint32_t PIXEL1825:4;
  uint32_t PIXEL1824:4;
} __GLCDCURDATA75bits_t;
extern volatile __GLCDCURDATA75bits_t GLCDCURDATA75bits __asm__ ("GLCDCURDATA75") __attribute__((section("sfrs"), address(0xBF8EA92C)));
#define GLCDCURDATA76 GLCDCURDATA76
extern volatile uint32_t   GLCDCURDATA76 __attribute__((section("sfrs"), address(0xBF8EA930)));
typedef struct {
  uint32_t PIXEL197:4;
  uint32_t PIXEL196:4;
  uint32_t PIXEL195:4;
  uint32_t PIXEL194:4;
  uint32_t PIXEL193:4;
  uint32_t PIXEL192:4;
  uint32_t PIXEL191:4;
  uint32_t PIXEL190:4;
} __GLCDCURDATA76bits_t;
extern volatile __GLCDCURDATA76bits_t GLCDCURDATA76bits __asm__ ("GLCDCURDATA76") __attribute__((section("sfrs"), address(0xBF8EA930)));
#define GLCDCURDATA77 GLCDCURDATA77
extern volatile uint32_t   GLCDCURDATA77 __attribute__((section("sfrs"), address(0xBF8EA934)));
typedef struct {
  uint32_t PIXEL1915:4;
  uint32_t PIXEL1914:4;
  uint32_t PIXEL1913:4;
  uint32_t PIXEL1912:4;
  uint32_t PIXEL1911:4;
  uint32_t PIXEL1910:4;
  uint32_t PIXEL199:4;
  uint32_t PIXEL198:4;
} __GLCDCURDATA77bits_t;
extern volatile __GLCDCURDATA77bits_t GLCDCURDATA77bits __asm__ ("GLCDCURDATA77") __attribute__((section("sfrs"), address(0xBF8EA934)));
#define GLCDCURDATA78 GLCDCURDATA78
extern volatile uint32_t   GLCDCURDATA78 __attribute__((section("sfrs"), address(0xBF8EA938)));
typedef struct {
  uint32_t PIXEL1923:4;
  uint32_t PIXEL1922:4;
  uint32_t PIXEL1921:4;
  uint32_t PIXEL1920:4;
  uint32_t PIXEL1919:4;
  uint32_t PIXEL1918:4;
  uint32_t PIXEL1917:4;
  uint32_t PIXEL1916:4;
} __GLCDCURDATA78bits_t;
extern volatile __GLCDCURDATA78bits_t GLCDCURDATA78bits __asm__ ("GLCDCURDATA78") __attribute__((section("sfrs"), address(0xBF8EA938)));
#define GLCDCURDATA79 GLCDCURDATA79
extern volatile uint32_t   GLCDCURDATA79 __attribute__((section("sfrs"), address(0xBF8EA93C)));
typedef struct {
  uint32_t PIXEL1931:4;
  uint32_t PIXEL1930:4;
  uint32_t PIXEL1929:4;
  uint32_t PIXEL1928:4;
  uint32_t PIXEL1927:4;
  uint32_t PIXEL1926:4;
  uint32_t PIXEL1925:4;
  uint32_t PIXEL1924:4;
} __GLCDCURDATA79bits_t;
extern volatile __GLCDCURDATA79bits_t GLCDCURDATA79bits __asm__ ("GLCDCURDATA79") __attribute__((section("sfrs"), address(0xBF8EA93C)));
#define GLCDCURDATA80 GLCDCURDATA80
extern volatile uint32_t   GLCDCURDATA80 __attribute__((section("sfrs"), address(0xBF8EA940)));
typedef struct {
  uint32_t PIXEL207:4;
  uint32_t PIXEL206:4;
  uint32_t PIXEL205:4;
  uint32_t PIXEL204:4;
  uint32_t PIXEL203:4;
  uint32_t PIXEL202:4;
  uint32_t PIXEL201:4;
  uint32_t PIXEL200:4;
} __GLCDCURDATA80bits_t;
extern volatile __GLCDCURDATA80bits_t GLCDCURDATA80bits __asm__ ("GLCDCURDATA80") __attribute__((section("sfrs"), address(0xBF8EA940)));
#define GLCDCURDATA81 GLCDCURDATA81
extern volatile uint32_t   GLCDCURDATA81 __attribute__((section("sfrs"), address(0xBF8EA944)));
typedef struct {
  uint32_t PIXEL2015:4;
  uint32_t PIXEL2014:4;
  uint32_t PIXEL2013:4;
  uint32_t PIXEL2012:4;
  uint32_t PIXEL2011:4;
  uint32_t PIXEL2010:4;
  uint32_t PIXEL209:4;
  uint32_t PIXEL208:4;
} __GLCDCURDATA81bits_t;
