MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB288/mcu.h
extern volatile __SBT4WR3bits_t SBT4WR3bits __asm__ ("SBT4WR3") __attribute__((section("sfrs"), address(0xBF8F90B8)));
#define SBT4REG4 SBT4REG4
extern volatile uint32_t   SBT4REG4 __attribute__((section("sfrs"), address(0xBF8F90C0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT4REG4bits_t;
extern volatile __SBT4REG4bits_t SBT4REG4bits __asm__ ("SBT4REG4") __attribute__((section("sfrs"), address(0xBF8F90C0)));
#define SBT4RD4 SBT4RD4
extern volatile uint32_t   SBT4RD4 __attribute__((section("sfrs"), address(0xBF8F90D0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4RD4bits_t;
extern volatile __SBT4RD4bits_t SBT4RD4bits __asm__ ("SBT4RD4") __attribute__((section("sfrs"), address(0xBF8F90D0)));
#define SBT4WR4 SBT4WR4
extern volatile uint32_t   SBT4WR4 __attribute__((section("sfrs"), address(0xBF8F90D8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT4WR4bits_t;
extern volatile __SBT4WR4bits_t SBT4WR4bits __asm__ ("SBT4WR4") __attribute__((section("sfrs"), address(0xBF8F90D8)));
#define SBT5ELOG1 SBT5ELOG1
extern volatile uint32_t   SBT5ELOG1 __attribute__((section("sfrs"), address(0xBF8F9420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT5ELOG1bits_t;
extern volatile __SBT5ELOG1bits_t SBT5ELOG1bits __asm__ ("SBT5ELOG1") __attribute__((section("sfrs"), address(0xBF8F9420)));
#define SBT5ELOG2 SBT5ELOG2
extern volatile uint32_t   SBT5ELOG2 __attribute__((section("sfrs"), address(0xBF8F9424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT5ELOG2bits_t;
extern volatile __SBT5ELOG2bits_t SBT5ELOG2bits __asm__ ("SBT5ELOG2") __attribute__((section("sfrs"), address(0xBF8F9424)));
#define SBT5ECON SBT5ECON
extern volatile uint32_t   SBT5ECON __attribute__((section("sfrs"), address(0xBF8F9428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT5ECONbits_t;
extern volatile __SBT5ECONbits_t SBT5ECONbits __asm__ ("SBT5ECON") __attribute__((section("sfrs"), address(0xBF8F9428)));
#define SBT5ECLRS SBT5ECLRS
extern volatile uint32_t   SBT5ECLRS __attribute__((section("sfrs"), address(0xBF8F9430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT5ECLRSbits_t;
extern volatile __SBT5ECLRSbits_t SBT5ECLRSbits __asm__ ("SBT5ECLRS") __attribute__((section("sfrs"), address(0xBF8F9430)));
#define SBT5ECLRM SBT5ECLRM
extern volatile uint32_t   SBT5ECLRM __attribute__((section("sfrs"), address(0xBF8F9438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT5ECLRMbits_t;
extern volatile __SBT5ECLRMbits_t SBT5ECLRMbits __asm__ ("SBT5ECLRM") __attribute__((section("sfrs"), address(0xBF8F9438)));
#define SBT5REG0 SBT5REG0
extern volatile uint32_t   SBT5REG0 __attribute__((section("sfrs"), address(0xBF8F9440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG0bits_t;
extern volatile __SBT5REG0bits_t SBT5REG0bits __asm__ ("SBT5REG0") __attribute__((section("sfrs"), address(0xBF8F9440)));
#define SBT5RD0 SBT5RD0
extern volatile uint32_t   SBT5RD0 __attribute__((section("sfrs"), address(0xBF8F9450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD0bits_t;
extern volatile __SBT5RD0bits_t SBT5RD0bits __asm__ ("SBT5RD0") __attribute__((section("sfrs"), address(0xBF8F9450)));
#define SBT5WR0 SBT5WR0
extern volatile uint32_t   SBT5WR0 __attribute__((section("sfrs"), address(0xBF8F9458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR0bits_t;
extern volatile __SBT5WR0bits_t SBT5WR0bits __asm__ ("SBT5WR0") __attribute__((section("sfrs"), address(0xBF8F9458)));
#define SBT5REG1 SBT5REG1
extern volatile uint32_t   SBT5REG1 __attribute__((section("sfrs"), address(0xBF8F9460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG1bits_t;
extern volatile __SBT5REG1bits_t SBT5REG1bits __asm__ ("SBT5REG1") __attribute__((section("sfrs"), address(0xBF8F9460)));
#define SBT5RD1 SBT5RD1
extern volatile uint32_t   SBT5RD1 __attribute__((section("sfrs"), address(0xBF8F9470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD1bits_t;
extern volatile __SBT5RD1bits_t SBT5RD1bits __asm__ ("SBT5RD1") __attribute__((section("sfrs"), address(0xBF8F9470)));
#define SBT5WR1 SBT5WR1
extern volatile uint32_t   SBT5WR1 __attribute__((section("sfrs"), address(0xBF8F9478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR1bits_t;
extern volatile __SBT5WR1bits_t SBT5WR1bits __asm__ ("SBT5WR1") __attribute__((section("sfrs"), address(0xBF8F9478)));
#define SBT5REG2 SBT5REG2
extern volatile uint32_t   SBT5REG2 __attribute__((section("sfrs"), address(0xBF8F9480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG2bits_t;
extern volatile __SBT5REG2bits_t SBT5REG2bits __asm__ ("SBT5REG2") __attribute__((section("sfrs"), address(0xBF8F9480)));
#define SBT5RD2 SBT5RD2
extern volatile uint32_t   SBT5RD2 __attribute__((section("sfrs"), address(0xBF8F9490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5RD2bits_t;
extern volatile __SBT5RD2bits_t SBT5RD2bits __asm__ ("SBT5RD2") __attribute__((section("sfrs"), address(0xBF8F9490)));
#define SBT5WR2 SBT5WR2
extern volatile uint32_t   SBT5WR2 __attribute__((section("sfrs"), address(0xBF8F9498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT5WR2bits_t;
extern volatile __SBT5WR2bits_t SBT5WR2bits __asm__ ("SBT5WR2") __attribute__((section("sfrs"), address(0xBF8F9498)));
#define SBT5REG3 SBT5REG3
extern volatile uint32_t   SBT5REG3 __attribute__((section("sfrs"), address(0xBF8F94A0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT5REG3bits_t;
