MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAB288/mcu.h
#define _GLCDCURDATA118_PIXEL2917_POSITION       0x00000018
#define _GLCDCURDATA118_PIXEL2917_MASK           0x0F000000
#define _GLCDCURDATA118_PIXEL2917_LENGTH         0x00000004

#define _GLCDCURDATA118_PIXEL2916_POSITION       0x0000001C
#define _GLCDCURDATA118_PIXEL2916_MASK           0xF0000000
#define _GLCDCURDATA118_PIXEL2916_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2931_POSITION       0x00000000
#define _GLCDCURDATA119_PIXEL2931_MASK           0x0000000F
#define _GLCDCURDATA119_PIXEL2931_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2930_POSITION       0x00000004
#define _GLCDCURDATA119_PIXEL2930_MASK           0x000000F0
#define _GLCDCURDATA119_PIXEL2930_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2929_POSITION       0x00000008
#define _GLCDCURDATA119_PIXEL2929_MASK           0x00000F00
#define _GLCDCURDATA119_PIXEL2929_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2928_POSITION       0x0000000C
#define _GLCDCURDATA119_PIXEL2928_MASK           0x0000F000
#define _GLCDCURDATA119_PIXEL2928_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2927_POSITION       0x00000010
#define _GLCDCURDATA119_PIXEL2927_MASK           0x000F0000
#define _GLCDCURDATA119_PIXEL2927_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2926_POSITION       0x00000014
#define _GLCDCURDATA119_PIXEL2926_MASK           0x00F00000
#define _GLCDCURDATA119_PIXEL2926_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2925_POSITION       0x00000018
#define _GLCDCURDATA119_PIXEL2925_MASK           0x0F000000
#define _GLCDCURDATA119_PIXEL2925_LENGTH         0x00000004

#define _GLCDCURDATA119_PIXEL2924_POSITION       0x0000001C
#define _GLCDCURDATA119_PIXEL2924_MASK           0xF0000000
#define _GLCDCURDATA119_PIXEL2924_LENGTH         0x00000004

#define _GLCDCURDATA120_PIXEL307_POSITION        0x00000000
#define _GLCDCURDATA120_PIXEL307_MASK            0x0000000F
#define _GLCDCURDATA120_PIXEL307_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL306_POSITION        0x00000004
#define _GLCDCURDATA120_PIXEL306_MASK            0x000000F0
#define _GLCDCURDATA120_PIXEL306_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL305_POSITION        0x00000008
#define _GLCDCURDATA120_PIXEL305_MASK            0x00000F00
#define _GLCDCURDATA120_PIXEL305_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL304_POSITION        0x0000000C
#define _GLCDCURDATA120_PIXEL304_MASK            0x0000F000
#define _GLCDCURDATA120_PIXEL304_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL303_POSITION        0x00000010
#define _GLCDCURDATA120_PIXEL303_MASK            0x000F0000
#define _GLCDCURDATA120_PIXEL303_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL302_POSITION        0x00000014
#define _GLCDCURDATA120_PIXEL302_MASK            0x00F00000
#define _GLCDCURDATA120_PIXEL302_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL301_POSITION        0x00000018
#define _GLCDCURDATA120_PIXEL301_MASK            0x0F000000
#define _GLCDCURDATA120_PIXEL301_LENGTH          0x00000004

#define _GLCDCURDATA120_PIXEL300_POSITION        0x0000001C
#define _GLCDCURDATA120_PIXEL300_MASK            0xF0000000
#define _GLCDCURDATA120_PIXEL300_LENGTH          0x00000004

#define _GLCDCURDATA121_PIXEL3015_POSITION       0x00000000
#define _GLCDCURDATA121_PIXEL3015_MASK           0x0000000F
#define _GLCDCURDATA121_PIXEL3015_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL3014_POSITION       0x00000004
#define _GLCDCURDATA121_PIXEL3014_MASK           0x000000F0
#define _GLCDCURDATA121_PIXEL3014_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL3013_POSITION       0x00000008
#define _GLCDCURDATA121_PIXEL3013_MASK           0x00000F00
#define _GLCDCURDATA121_PIXEL3013_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL3012_POSITION       0x0000000C
#define _GLCDCURDATA121_PIXEL3012_MASK           0x0000F000
#define _GLCDCURDATA121_PIXEL3012_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL3011_POSITION       0x00000010
#define _GLCDCURDATA121_PIXEL3011_MASK           0x000F0000
#define _GLCDCURDATA121_PIXEL3011_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL3010_POSITION       0x00000014
#define _GLCDCURDATA121_PIXEL3010_MASK           0x00F00000
#define _GLCDCURDATA121_PIXEL3010_LENGTH         0x00000004

#define _GLCDCURDATA121_PIXEL309_POSITION        0x00000018
#define _GLCDCURDATA121_PIXEL309_MASK            0x0F000000
#define _GLCDCURDATA121_PIXEL309_LENGTH          0x00000004

#define _GLCDCURDATA121_PIXEL308_POSITION        0x0000001C
#define _GLCDCURDATA121_PIXEL308_MASK            0xF0000000
#define _GLCDCURDATA121_PIXEL308_LENGTH          0x00000004

#define _GLCDCURDATA122_PIXEL3023_POSITION       0x00000000
#define _GLCDCURDATA122_PIXEL3023_MASK           0x0000000F
#define _GLCDCURDATA122_PIXEL3023_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3022_POSITION       0x00000004
#define _GLCDCURDATA122_PIXEL3022_MASK           0x000000F0
#define _GLCDCURDATA122_PIXEL3022_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3021_POSITION       0x00000008
#define _GLCDCURDATA122_PIXEL3021_MASK           0x00000F00
#define _GLCDCURDATA122_PIXEL3021_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3020_POSITION       0x0000000C
#define _GLCDCURDATA122_PIXEL3020_MASK           0x0000F000
#define _GLCDCURDATA122_PIXEL3020_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3019_POSITION       0x00000010
#define _GLCDCURDATA122_PIXEL3019_MASK           0x000F0000
#define _GLCDCURDATA122_PIXEL3019_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3018_POSITION       0x00000014
#define _GLCDCURDATA122_PIXEL3018_MASK           0x00F00000
#define _GLCDCURDATA122_PIXEL3018_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3017_POSITION       0x00000018
#define _GLCDCURDATA122_PIXEL3017_MASK           0x0F000000
#define _GLCDCURDATA122_PIXEL3017_LENGTH         0x00000004

#define _GLCDCURDATA122_PIXEL3016_POSITION       0x0000001C
#define _GLCDCURDATA122_PIXEL3016_MASK           0xF0000000
#define _GLCDCURDATA122_PIXEL3016_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3031_POSITION       0x00000000
#define _GLCDCURDATA123_PIXEL3031_MASK           0x0000000F
#define _GLCDCURDATA123_PIXEL3031_LENGTH         0x00000004

#define _GLCDCURDATA123_PIXEL3030_POSITION       0x00000004
#define _GLCDCURDATA123_PIXEL3030_MASK           0x000000F0
#define _GLCDCURDATA123_PIXEL3030_LENGTH         0x00000004

